---
type: ExternalGeometryId
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# ExternalGeometryId

`Autodesk.Revit.DB.ExternalGeometryId` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExternalGeometryId | 2022 | `public ExternalGeometryId ( string externalGeometryId )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Equals | — | `public override bool Equals ( Object obj )` |
| Method | GetHashCode | — | `public override int GetHashCode ()` |
| Method | IsValidExternalGeometryId | 2022 | `public static bool IsValidExternalGeometryId ( string externalGeometryId )` |
| Property | Id | 2022 | `public string Id { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |